tutorial/hardwood/poplar(Zhang2016)/20K/CRECK2018/system/manualDecomposition
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       labelList;
    location    "constant";
    object      cellDecomposition;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


81
(
0
0
1
1
1
2
2
2
2
0
0
1
1
1
2
2
2
2
0
0
1
1
1
2
2
2
2
0
0
1
1
1
2
2
2
2
0
0
1
1
1
2
2
2
2
0
0
1
1
1
2
2
2
2
0
0
1
1
1
2
2
2
2
0
0
1
1
1
2
2
2
2
0
0
1
1
1
2
2
2
2
)


// ************************************************************************* //
